In [2]:
import pandas as pd
import os

In [2]:
#getting the files fro directory
files =[]
for file in os.listdir('./raw_datas'):
    files.append(file)

In [3]:
#set up a empty data frame.
#concate all the the data frame to one data frame
months_all_data = pd.DataFrame()

for file in files: # getting files name from the list
    df=pd.read_csv('./raw_datas/'+file) # load each csv file to df
    months_all_data=pd.concat([months_all_data,df])
    
    
months_all_data.to_csv('./all_data_combined/all_data.csv')

In [18]:
all_data = pd.read_csv('./all_data_combined/all_data.csv')

In [5]:
#saveing the description and data types for comparing the cahnges after modify
'''
raw_description=pd.DataFrame(all_data.describe())
raw_description.to_csv("./raw_data_description/combined_raw_data_description.csv")
data_types = pd.DataFrame(all_data.dtypes)
data_types.to_csv('./raw_data_description/combined_data_datatypes.csv')

toal_data_by_column=pd.DataFrame(all_data.count())
toal_data_by_column.to_csv('./raw_data_description/toal_data_by_column.csv')
total_null_values_by_coulum =pd.DataFrame(all_data.isnull().sum())
total_null_values_by_coulum.to_csv('./raw_data_description/total_null_values_by_coulum.csv')
'''
print(all_data.isnull().sum())
print(all_data.columns.isnull())

Unnamed: 0            0
Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64
[False False False False False False False]

In [6]:
#every columm has null value

In [7]:
#testing perpouse
'''
description_list = ["raw_description","data_types","toal_data_by_column"]
method_list = ["describe()","dtypes","count()"]
dict_data ={
    "raw_description_1":all_data.describe(),
    "data_types_1":all_data.dtypes,
    "toal_data_by_column_1":all_data.count()
}
'''

'\ndescription_list = ["raw_description","data_types","toal_data_by_column"]\nmethod_list = ["describe()","dtypes","count()"]\ndict_data ={\n    "raw_description_1":all_data.describe(),\n    "data_types_1":all_data.dtypes,\n    "toal_data_by_column_1":all_data.count()\n}\n'

In [8]:
all_data.isnull().sum().sum()

3270

In [14]:
all_data.shape

(186850, 7)

In [15]:
all_data = all_data[all_data.isna().any(axis=1)]

In [16]:
all_data.shape

(545, 7)

In [10]:
"""
nan_value_df.to_csv('./raw_data_description/null_values.csv',index=False)
"""

"\nnan_value_df.to_csv('./raw_data_description/null_values.csv',index=False)\n"

In [12]:
# drop null values
all_data=all_data.dropna(how='all')

In [17]:
all_data.head()

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1,1,NaN,NaN,NaN,NaN,NaN,NaN
356,356,NaN,NaN,NaN,NaN,NaN,NaN
735,735,NaN,NaN,NaN,NaN,NaN,NaN
1433,1433,NaN,NaN,NaN,NaN,NaN,NaN
1553,1553,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
all_data.head()

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,1,NaN,NaN,NaN,NaN,NaN,NaN
2,2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"